## Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
# For data with float64 dtype, pandas uses the floating-point value NaN (Not a Number) to represent missing data
float_data=pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna() # isna method gives us a Boolean Series with True where values are null

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# The built-in Python None value is also treated as NA
string_data=pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data=pd.Series([1,2,None],dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [8]:
# Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate
string_data.dropna()

0    aardvark
3     avocado
dtype: object

In [9]:
float_data.fillna(0) # Fill in missing data with some value or using an interpolation method such as "ffill" or "bfill"

0    1.0
1    2.0
2    0.0
dtype: float64

In [10]:
string_data.notna() # returns True for non-NA values and False for NA values

0     True
1    False
2    False
3     True
dtype: bool

### Filtering Out Missing Data

In [11]:
data=pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data=pd.DataFrame([[1., 6.5, 3.],[1., np.nan, np.nan],[np.nan, np.nan, np.nan],[np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna() # dropna by default drops any row containing a missing value

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how="all") # Passing how="all" will drop only rows that are all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

Keep in mind that these functions return new objects by default and do not modify the contents of the original object

In [16]:
data[4]=np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df=pd.DataFrame(np.random.standard_normal((7,3)))

In [19]:
df.iloc[:4,1]=np.nan
df.iloc[:2,2]=np.nan

In [20]:
df

          0         1         2
0 -0.043128       NaN       NaN
1 -1.237660       NaN       NaN
2 -1.033651       NaN -0.098601
3  0.396131       NaN  0.356988
4  0.371744 -0.706813  0.059279
5  0.714324  0.829468 -0.291174
6  0.179835 -0.599214 -1.331808

In [21]:
df.dropna()

          0         1         2
4  0.371744 -0.706813  0.059279
5  0.714324  0.829468 -0.291174
6  0.179835 -0.599214 -1.331808

In [22]:
df.dropna(thresh=2) # Suppose you want to keep only rows containing at most a certain number of missing observations. You can indicate this with the thresh argument

          0         1         2
2 -1.033651       NaN -0.098601
3  0.396131       NaN  0.356988
4  0.371744 -0.706813  0.059279
5  0.714324  0.829468 -0.291174
6  0.179835 -0.599214 -1.331808

### Filling In Missing Data

In [23]:
df.fillna(0) #  Calling fillna with a constant replaces missing values with that value

          0         1         2
0 -0.043128  0.000000  0.000000
1 -1.237660  0.000000  0.000000
2 -1.033651  0.000000 -0.098601
3  0.396131  0.000000  0.356988
4  0.371744 -0.706813  0.059279
5  0.714324  0.829468 -0.291174
6  0.179835 -0.599214 -1.331808

In [24]:
# Calling fillna with a dictionary, you can use a different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.043128  0.500000  0.000000
1 -1.237660  0.500000  0.000000
2 -1.033651  0.500000 -0.098601
3  0.396131  0.500000  0.356988
4  0.371744 -0.706813  0.059279
5  0.714324  0.829468 -0.291174
6  0.179835 -0.599214 -1.331808

In [25]:
df=pd.DataFrame(np.random.standard_normal((6,3)))
df.iloc[2:,1]=np.nan
df.iloc[4:,2]=np.nan
df

          0         1         2
0  0.471025 -0.445759 -0.565816
1 -0.838382  1.476788 -0.794496
2 -1.795819       NaN  2.011946
3  0.361611       NaN  1.159418
4 -1.268476       NaN       NaN
5 -0.801916       NaN       NaN

In [26]:
df.ffill()

          0         1         2
0  0.471025 -0.445759 -0.565816
1 -0.838382  1.476788 -0.794496
2 -1.795819  1.476788  2.011946
3  0.361611  1.476788  1.159418
4 -1.268476  1.476788  1.159418
5 -0.801916  1.476788  1.159418

In [27]:
df.ffill(limit=2) # For forward and backward filling, maximum number of consecutive periods to fill

          0         1         2
0  0.471025 -0.445759 -0.565816
1 -0.838382  1.476788 -0.794496
2 -1.795819  1.476788  2.011946
3  0.361611  1.476788  1.159418
4 -1.268476       NaN  1.159418
5 -0.801916       NaN  1.159418

In [28]:
data=pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [29]:
data=pd.DataFrame({"k1":["one","two"]*3+["two"],"k2":[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
# The DataFrame method duplicated returns a Boolean Series indicating whether each row is a duplicate (its column values are exactly equal to those in an earlier row) or not

data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates() # drop_duplicates returns a DataFrame with rows where the duplicated array is False filtered out

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data["v1"]=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
# duplicated and drop_duplicates by default keep the first observed value combination. Passing keep="last" will return the last one
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [35]:
data.drop_duplicates(subset=["k2"])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

### Transforming Data Using a Function or Mapping

In [36]:
data=pd.DataFrame({"food":["bacon", "pulled pork", "bacon","pastrami", "corned beef", "bacon","pastrami", "honey ham", "nova lox"],"ounces":[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [37]:
meat_to_animal={"bacon":"pig",
                "pulled pork": "pig",
                "pastrami": "cow",
                 "corned beef": "cow",
                "honey ham": "pig",
                "nova lox": "salmon"}

In [38]:
data["animal"]=data["food"].map(meat_to_animal)

In [39]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [40]:
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [41]:
data=pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace(-999,np.nan) # The -999 values might be sentinel values for missing data. To replace these with NA values that pandas understands, we can use replace, producing a new Series

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [43]:
# replace multiple values at once, you instead pass a list and then the substitute value
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [44]:
# To use a different replacement for each value, pass a list of substitutes
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [45]:
# The argument passed can also be a dictionary
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

Like values in a Series, axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects. You can also modify the axes in place without creating a new data structure. Here’s a simple example

In [47]:
data=pd.DataFrame(np.arange(12).reshape(3,4),
                  index=["Ohio", "Colorado", "New York"],
                  columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [48]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [50]:
data.index=data.index.map(transform) # You can assign to the index attribute, modifying the DataFrame in place
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [51]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [53]:
data.rename(index={"OHIO":"OOO"}) # rename can be used in conjunction with a dictionary-like object, providing new values for a subset of the axis labels

      one  two  three  four
OOO     0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
data.rename(index={"OHIO":"INDIANA"},columns={"three":"peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

rename saves you from the chore of copying the DataFrame manually and assigning new values to its index and columns attributes

### Discretization and Binning

In [56]:
# Continuous data is often discretized or otherwise separated into “bins” for analysis. Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets

ages=[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [57]:
#  divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To do so, you have to use pandas.cut


bins=[18,25,35,60,100]
age_categories=pd.cut(ages,bins)

In [58]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [59]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [60]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [62]:
pd.value_counts(age_categories)

C:\Users\thami\AppData\Local\Temp\ipykernel_21432\3004322060.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [65]:
data=pd.DataFrame(np.random.standard_normal((1000,4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.031192     0.016119    -0.007765    -0.039229
std       1.012486     0.997858     1.013415     0.977260
min      -3.353991    -3.507671    -3.743582    -3.474466
25%      -0.650838    -0.633684    -0.699872    -0.696853
50%       0.017211     0.009925     0.005394    -0.064816
75%       0.666334     0.678918     0.691034     0.630156
max       3.609567     3.330240     4.814039     2.789134

In [68]:
# Suppose you wanted to find values in one of the columns exceeding 3 in absolute value
col=data[2]
col[col.abs()>3]

84     3.093176
259   -3.050258
471   -3.003725
482   -3.743582
559    3.335731
572   -3.597043
612    4.814039
Name: 2, dtype: float64

In [69]:
# To select all rows having a value exceeding 3 or –3, you can use the any method on a Boolean DataFrame

data[(data.abs()>3).any(axis="columns")] # The parentheses around data.abs() > 3 are necessary in order to call the any method on the result of the comparison operation

            0         1         2         3
28   0.209888  0.110890  0.927178 -3.065805
84   1.180504  0.224744  3.093176  0.562840
139  3.266392  1.044132 -0.496971 -0.325239
194  3.609567  1.494511  0.480711  0.445929
201 -3.116201  1.020936 -1.163513  1.128068
259  0.190094  0.043143 -3.050258  0.850697
368 -0.369966  3.330240  0.746907  0.037126
471  1.551452  1.199011 -3.003725  1.339758
482 -0.457574 -1.016232 -3.743582  0.109543
559 -0.252545  0.111196  3.335731  0.366783
572  0.715427  0.357631 -3.597043  0.270999
594 -0.928779 -3.382152  0.400243 -0.076261
612  2.799878 -0.015120  4.814039 -1.017418
800  1.543111 -3.507671 -0.849055 -0.138549
863 -3.353991  0.017876  1.173587  0.660711
919 -0.401093  0.493843  0.028949 -3.474466

In [70]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1 -1.0 -1.0  1.0  1.0
2 -1.0  1.0  1.0 -1.0
3  1.0  1.0 -1.0  1.0
4  1.0  1.0 -1.0  1.0

### Permutation and Random Sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is possible using the numpy.random.permutation function. Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering

In [71]:
df=pd.DataFrame(np.arange(5*7).reshape(5,7))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [73]:
sampler=np.random.permutation(5)
sampler

array([0, 4, 1, 3, 2], dtype=int32)

In [74]:
# That array can then be used in iloc-based indexing or the equivalent take function
df.take(sampler)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20

In [75]:
df.iloc[sampler]

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20

In [77]:
# By invoking take with axis="columns", we could also select a permutation of the columns
column_sampler=np.random.permutation(7)
df.take(column_sampler,axis="columns")

    3   0   5   4   2   6   1
0   3   0   5   4   2   6   1
1  10   7  12  11   9  13   8
2  17  14  19  18  16  20  15
3  24  21  26  25  23  27  22
4  31  28  33  32  30  34  29

In [78]:
# To select a random subset without replacement (the same row cannot appear twice), you can use the sample method on Series and DataFrame
df.sample(n=3)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

### Computing Indicator/Dummy Variables

Another type of transformation for statistical modeling or machine learning applications is converting a categorical variable into a dummy or indicator matrix. If a column in a DataFrame has k distinct values, you would derive a matrix or DataFrame with k columns containing all 1s and 0s. pandas has a pandas.get_dummies function for doing this, though you could also devise one yourself. Let’s consider an example DataFrame

In [79]:
df=pd.DataFrame({"key":["b", "b", "a", "c", "a", "b"],"data1":range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [85]:
pd.get_dummies(df["key"]).astype(int)

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [84]:
dummies=pd.get_dummies(df['key'],prefix="key").astype(int)
df_with_dummy=df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [89]:
mnames=["movie_id", "title", "genres"]
movies=pd.read_table("datasets/movielens/movies.dat",sep="::",header=None,names=mnames,engine="python")

In [90]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [91]:
dummies=movies["genres"].str.get_dummies("|")

In [94]:
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [95]:
# Then, as before, you can combine this with movies while adding a "Genre_" to the column names in the dummies DataFrame with the add_prefix method

movies_windic=movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [96]:
movies_windic[:10]

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0,1,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),Comedy|Romance,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),Comedy|Drama,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Father of the Bride Part II (1995),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
5,6,Heat (1995),Action|Crime|Thriller,1,0,0,0,0,1,0,...,0,0,0,0,0,0,0,1,0,0
6,7,Sabrina (1995),Comedy|Romance,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,0
7,8,Tom and Huck (1995),Adventure|Children's,0,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8,9,Sudden Death (1995),Action,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
9,10,GoldenEye (1995),Action|Adventure|Thriller,1,1,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

### String Manipulation

In [97]:
val="a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [98]:
# split is often combined with strip to trim whitespace (including line breaks)

pieces=[x.strip() for x in val.split(",")]

In [99]:
pieces

['a', 'b', 'guido']

In [100]:
# first, second, third = pieces
first, second, third = pieces
first+"::"+second+"::"+third

'a::b::guido'

In [101]:
# But this isn’t a practical generic method. A faster and more Pythonic way is to pass a list or tuple to the join method on the string "::"

"::".join(pieces)

'a::b::guido'

In [102]:
"a" in pieces

True

In [103]:
pieces.index("a")

0

In [105]:
val.find(":")

-1

In [107]:
val.count(",") # count returns the number of occurrences of a particular substring

2

In [108]:
val.replace(",","::")

'a::b::  guido'

In [109]:
type(val),type(pieces)

(str, list)

In [114]:
end_with_o=[x for x in pieces if x.endswith("o")]

In [115]:
end_with_o

['guido']

### Regular Expressions